import json
import time
import requests
import streamlit as st

st.set_page_config(
    page_title="Data visuaiization Project",
    page_icon= ":bar_chart:",
)
st.sidebar.success("เลือกรายการด้านบน.")

st.header("# 🍀🍀🍀 การทำจินตทัศน์ข้อมูลการใช้platform! 👋  🧑🏽‍🏫 ")
st.subheader(" 1.หลักการและเหตุผล")
st.info("""1.การนำเสนอข้อมูลอย่างชัดเจน: การทำจินตทัศน์ข้อมูลช่วยให้สามารถแสดงข้อมูลเกี่ยวกับการใช้แพลตฟอร์มอย่างชัดเจนและกระชับ เช่น กราฟแท่งหรือกราฟวงกลมที่แสดงสัดส่วนของการใช้แพลตฟอร์มแต่ละอย่าง

2.การวิเคราะห์แนวโน้ม: การทำจินตทัศน์ข้อมูลช่วยให้สามารถวิเคราะห์แนวโน้มของการใช้แพลตฟอร์มต่างๆ ได้ เช่น การดูว่าแพลตฟอร์มใดมีการเพิ่มขึ้นหรือลดลงในช่วงเวลาที่เท่าไร

3.การตรวจสอบความสัมพันธ์: การทำจินตทัศน์ข้อมูลช่วยให้สามารถตรวจสอบความสัมพันธ์ระหว่างการใช้แพลตฟอร์มกับตัวแปรอื่นๆ ได้ เช่น การดูว่ามีความสัมพันธ์ระหว่างการใช้แพลตฟอร์มกับยอดขายสินค้าหรือบริการหรือไม่

4.การบริหารจัดการ: การทำจินตทัศน์ข้อมูลช่วยให้สามารถจัดการและวางแผนการทำงานต่อไปในองค์กรหรือธุรกิจได้ด้วยประสิทธิภาพ เช่น การใช้ข้อมูลการใช้แพลตฟอร์มในการวางแผนกลยุทธ์การตลาดหรือการพัฒนาผลิตภัณฑ์ใหม่

5.การตัดสินใจที่มีเหตุผล: การทำจินตทัศน์ข้อมูลช่วยให้สามารถตัดสินใจในการวางแผนและปรับปรุงกิจกรรมต่างๆ ในองค์กรหรือธุรกิจได้ที่มีเหตุผลและพื้นฐาน เช่น การตัดสินใจเลือกใช้แพลตฟอร์มในการตลาดหรือการโฆษณาอย่างไรให้เหมาะสมกับกลุ่มเป้าหมายและวัตถุประสงค์การทำงาน""")
st.subheader(" 2.วัตถุประสงค์")
st.info("""
        เพื่อนำเสนอข้อมูลในรูปแบบที่เข้าใจได้ง่ายด้วยวิธีการจินตทัศน์ข้อมูล
        """)
st.balloons()