import json
import time
import requests
import streamlit as st

st.set_page_config(
    page_title="Data visuaiization Project",
    page_icon= ":bar_chart:",
)
st.sidebar.success("เลือกรายการด้านบน.")

st.header("# 🍀🍀🍀 การทำจินตทัศน์ข้อมูล....! 👋  🧑🏽‍🏫 ")
st.subheader(" 1.หลักการและเหตุผล")
st.info("""1.การทำให้ข้อมูลเป็นทรานด์: ข้อมูลที่แตกต่างกันมักมีลักษณะและคุณลักษณะที่ซับซ้อนต่างกัน การใช้จินตทัศน์ข้อมูลช่วยในการแปลงข้อมูลที่ซับซ้อนเป็นรูปภาพที่เข้าใจง่าย ทำให้เราสามารถมองเห็นความสัมพันธ์ รูปแบบ และแนวโน้มของข้อมูลได้โดยง่าย
2.การสื่อสาร: จินตทัศน์ข้อมูลช่วยในการสื่อสารข้อมูลให้กับผู้อื่นหรือกลุ่มเป้าหมายได้อย่างชัดเจน ซึ่งทำให้สามารถแบ่งปันความรู้และข้อมูลได้สะดวก
3.การค้นพบข้อสรุป: การดูข้อมูลในรูปแบบต่างๆ ช่วยให้สามารถค้นพบแนวโน้ม ลักษณะเฉพาะ หรือข้อสรุปที่สำคัญของข้อมูลได้โดยง่าย โดยไม่จำเป็นต้องอ่านข้อมูลทั้งหมด
4.การวิเคราะห์: จินตทัศน์ข้อมูลช่วยในการวิเคราะห์ข้อมูลเพิ่มเติม เช่น การพยากรณ์ การตรวจสอบความสัมพันธ์ และการทำนายเพื่อเข้าใจข้อมูลในระดับลึกมากขึ้น
5.การสร้างแรงจูงใจ: การแสดงข้อมูลในรูปแบบที่สวยงามและน่าสนใจสามารถสร้างแรงจูงใจให้กับผู้ที่มองเห็นและประสบการณ์การใช้งานที่ดีขึ้น""")
st.subheader(" 2.วัตถุประสงค์")
st.info("""
        เพื่อนำเสนอข้อมูลในรูปแบบที่เข้าใจได้ง่ายด้วยวิธีการจินตทัศน์ข้อมูล
        """)
st.balloons()