import json
import time
import requests
import streamlit as st
from streamlit_lottie import st_lottie
from streamlit_lottie import st_lottie_spinner

def load_lottieurl(url: str):
    r = requests.get(url)
    if r.status_code != 200:
        return None
    return r.json()

lottie_url_hello = "https://lottie.host/3c495217-dd5c-4b8e-b736-c4d11408e2e7/ALKATO4SpO.json"
lottie_hello = load_lottieurl(lottie_url_hello)
st_lottie(lottie_hello, key="hello")

st.header("ทฤษฎีที่เกี่ยวข้อง")

st.subheader("1.ทฤษฎีเหมืองข้อมูล")
st.info("""
ทฤษฎีเหมืองข้อมูล (Data Mining) เป็นกระบวนการที่ใช้เครื่องมือและเทคนิคต่าง ๆ เพื่อค้นหาและวิเคราะห์ข้อมูลที่มีประโยชน์จากชุดข้อมูลขนาดใหญ่ โดยมุ่งเน้นการค้นหาความรู้ที่ซ่อนอยู่ในข้อมูล และช่วยให้เกิดความเข้าใจและข้อมูลเชิงลึกเกี่ยวกับปัญหาหรือแนวโน้มที่เกิดขึ้นในฐานข้อมูลนั้น ๆ

ขั้นตอนในการทำทฤษฎีเหมืองข้อมูลสามารถแบ่งออกเป็นขั้นตอนต่อไปนี้:

1.การเตรียมข้อมูล (Data Preparation): ขั้นตอนนี้เกี่ยวกับการเตรียมข้อมูลเพื่อให้พร้อมสำหรับการวิเคราะห์ รวมถึงการทำความสะอาดข้อมูล (Data Cleaning) เช่นการจัดการข้อมูลที่ขาดหายไปหรือซ้ำซ้อน การแปลงข้อมูลให้อยู่ในรูปแบบที่เหมาะสม และการเลือกคุณลักษณะ (Feature Selection) เพื่อลดขนาดและเพิ่มประสิทธิภาพในการวิเคราะห์

2.การทำความเข้าใจข้อมูล (Data Understanding): ขั้นตอนนี้เป็นการสำรวจและทำความเข้าใจข้อมูลโดยลึกซึ้ง เพื่อทราบถึงคุณสมบัติและความสัมพันธ์ระหว่างข้อมูลต่าง ๆ ในชุดข้อมูล

3.การโมเดลข้อมูล (Modeling): ในขั้นตอนนี้ เทคนิคและวิธีการต่าง ๆ จะถูกใช้เพื่อสร้างและประมวลผลโมเดลข้อมูล ซึ่งอาจ包括 การใช้เทคนิคการเรียนรู้ของเครื่อง (Machine Learning) หรือวิธีการอื่น ๆ เพื่อสร้างโมเดลที่สามารถใช้ในการทำนายหรือการจัดกลุ่มข้อมูล

4.การประเมินและการปรับปรุง (Evaluation and Refinement): หลังจากได้รับโมเดลที่สร้างขึ้นแล้ว จะต้องมีการประเมินประสิทธิภาพของโมเดลด้วยเทคนิคที่เหมาะสม และสามารถปรับปรุงโมเดลตามผลการประเมินเพื่อให้มีประสิทธิภาพมากยิ่งขึ้น

5.การนำเสนอและการใช้งาน (Presentation and Deployment): ในขั้นตอนสุดท้าย ข้อมูลที่ได้รับการวิเคราะห์และโมเดลที่สร้างขึ้นจะถูกนำเสนอให้กับผู้ใช้หรือผู้ตัดสินใจ ซึ่งอาจจะเป็นผ่านการสร้างรายงาน หรือการน
""")

st.subheader("2.เทคนิคการการทำจินตทัศน์ข้อมูล")
st.info("""
เทคนิคการทำจินตทัศน์ข้อมูล (Data Visualization Techniques) เป็นเครื่องมือที่มีประโยชน์ในการแสดงข้อมูลและสร้างความเข้าใจต่อข้อมูลอย่างมีประสิทธิภาพ ซึ่งช่วยให้ผู้ใช้สามารถรับรู้และวิเคราะห์ข้อมูลได้อย่างรวดเร็วและเข้าใจง่ายมากขึ้น ดังนั้น เรียนรู้เทคนิคการทำจินตทัศน์ข้อมูลจึงเป็นสิ่งสำคัญที่จะช่วยให้ผู้ใช้สามารถนำเสนอข้อมูลอย่างมีประสิทธิภาพได้ นี่คือเทคนิคบางประการที่ใช้ในการทำจินตทัศน์ข้อมูล:

กราฟและแผนภูมิ: การใช้กราฟและแผนภูมิเป็นเครื่องมือที่มีประสิทธิภาพในการแสดงข้อมูล โดยสามารถใช้ได้กับหลายประเภทของข้อมูล เช่น กราฟเส้นสำหรับแสดงแนวโน้มของข้อมูลตามเวลา แผนภูมิแท่งสำหรับเปรียบเทียบข้อมูลระหว่างกลุ่ม หรือแผนภูมิวงกลมสำหรับแสดงสัดส่วนของข้อมูล
""")